Revit 2024 API
DeleteElements Class
 Deletes element(s) related to the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class DeleteElements : FailureResolution
Visual Basic
Public Class DeleteElements _
	Inherits FailureResolution
Visual C++
public ref class DeleteElements : public FailureResolution
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureResolution
 Autodesk.Revit.DB.DeleteElements
See Also
DeleteElements Members
Autodesk.Revit.DB Namespace